[UIManageAppearance]
PresetDefault = "По умолчанию"
PresetUniform = "Униформа"
PresetEntireUnit = "Весь оперативник"
PresetPatterns = "Шаблоны"
PresetNothing = "Ничего"

strApplyTo = "ПРИМЕНИТЬ"
strApplyChangesButton = "Применить изменения"
strApplyChangesButtonDisabled = "Нет изменений для применения. Выберите внешний вид из списка справа и включите косметические параметры в списке слева."

strApplyToThisUnit = "ЭТОТ ОПЕРАТИВНИК"
strApplyToThisUnitTip = "Если включено, изменения внешнего вида будут применены к этому конкретному оперативнику."
strApplyToSquadTip = "Если включено, изменения внешнего вида будут применены ко всем оперативникам, которые в данный момент находятся в отряде."
strApplyToBarracksTip = "Если включено, изменения внешнего вида будут применены ко всем оперативникам в казарме, кроме оперативников в отряде и этого оперативника."
strApplyToCPTip = "Если включено, изменения внешнего вида будут применены ко всем оперативникам в пуле персонажей, кроме этого оперативника."

strFiltersTitle = "ФИЛЬТРЫ"

strSelectAppearanceTitle = "ВЫБЕРИТЕ ВНЕШНИЙ ВИД"
strSearchTitle = "Поиск"
strNoArmorTemplateError = "Фильтр брони отключен. Причина: не удалось найти броню, экипированную на этот оперативник."

strOriginalAppearance = "ОРИГИНАЛЬНЫЙ ВНЕШНИЙ ВИД"
strUniformsTitle = "УНИФОРМА"

strExitScreenPopupTitle = "ПОДТВЕРДИТЬ ВЫХОД"
strExitScreenPopupText = "Изменения внешнего вида еще не применялись. Вы уверены, что хотите закрыть это окно?\n\nСовет: нажмите кнопку \"Применить изменения\" в центре нижней части экрана, чтобы применить изменения внешнего вида."
strExitScreenPopup_Leave = "Выйти без изменений"
strExitScreenPopup_Stay = "Оставайтесь на экране"

strShowAllOptions = "ПОКАЗАТЬ ВСЕ ВАРИАНТЫ"

strNotAvailableInCharacterPool = "Недоступно в пуле персонажей."
strSameGenderRequired = "Этот вариант внешнего вида заблокирован из-за несоответствия пола с выбранным внешним видом."
strCopyPreset = "Копировать Пресет"
strCopyPresetButtonDisabled = "Пресеты можно копировать только в Пресет по умолчанию."
strDeletePreset = "Удалить Пресет"
strCannotDeleteThisPreset = "Мод не может работать без этого пресета, его нельзя удалить."

strConfirmApplyChangesTitle = "ПРИМЕНИТЬ ИЗМЕНЕНИЯ?"
strConfirmApplyChangesText = "Внимание! Вы собираетесь применить изменения внешнего вида к %NUM_UNITS% объектам. Продолжить?"

strCreatePreset = "Создать пресет"
strCreatePresetTitle = "Введите новое имя предустановки:"
strCreatePresetText = "_Copy"

strDuplicatePresetDisallowedTitle = "Не удалось добавить новый пресет!"
strDuplicatePresetDisallowedText = "Предустановка с таким названием уже существует. Прерывание."
strInvalidPresetNameText = "Недопустимое имя предустановки. Прерывание."

strSaveAsUniform = "Сохранить как униформу"
strEnterUniformName = "Введите имя униформы:"

strFailedToCreateUnitTitle = "ОШИБКА!"
strFailedToCreateUnitText = "Не удалось создать униформу с использованием шаблона персонажа: "

strInvalidEmptyUniformNameTitle = "Недопустимое универсальное имя"
strInvalidEmptyUniformNameText = "Унифицированное имя не может быть пустым."

strRacePrefix = "Раса "

[X2BackupPoolLoader]
strLoadBackupTitle = "Восстановить пул персонажей из резервной копии?" 
strLoadBackupText = "Менеджер внешнего вида обнаружил, что ваш пул персонажей или его дополнительные данные были потеряны. Текущее количество солдат: %CURRENT_SOLDIERS%, текущие дополнительные данные: %CURRENT_DATA%.\n\nДоступна резервная копия пула персонажей. Он содержит %BACKUP_SOLDIERS% солдат и %BACKUP_DATA% дополнительных данных. Вы хотите восстановить свой пул персонажей из этой резервной копии?\n\nЕсли вы согласитесь, ваш текущий пул персонажей будет полностью перезаписан резервной копией.\nЕсли вы продолжите без восстановления пула персонажей сейчас, сама резервная копия может быть перезаписана при сохранении пула персонажей, что происходит всякий раз, когда в него вносятся какие-либо изменения."

[UISL_AppearanceManager]

strManageAppearance = "Управление внешним видом"
strStoredAppearance = "Сохраненный внешний вид"

strConvertButtonTitle = "Преобразовать"

strConverToUniform = "Преобразовать в униформу"
strConvertToSoldier = "Превратить в солдата"

strVadlidateAppearance = "Проверить внешний вид"
strVadlidateAppearanceButton = "Подтвердить"

strConfigureUniform = "Настроить униформу"
strUniformSoldierFirstName = "Униформа"

strAutoManageUniformForUnitTitle = "Управление униформой"
strAutoManageUniformForUnit[0] = "Глобальные настройки"
strAutoManageUniformForUnit[1] = "Всегда принимайте униформу"
strAutoManageUniformForUnit[2] = "Никогда не принимайте униформу"

strUniformStatusTitle = "Управление униформой"
;strUniformStatus[0] = "Не униформа" - на самом деле не отображается.
strUniformStatus[0] = "Не применять автоматически"
strUniformStatus[1] = "Применить к любому классу солдат"
strUniformStatus[2] = "Применить к тому же классу солдат"
strUniformStatus[3] = "Применить к персонажам, не являющимся солдатами"

;strUniformStatus[0] = "<font color='#27aae1'>Не применять автоматически</font>" ; blue
;strUniformStatus[1] = "<font color='#53b45e'>Применить к любому классу солдат</font>" ; green
;strUniformStatus[2] = "<font color='#fdce2b'>Применить к тому же классу солдат</font>" ; yellow
;strUniformStatus[3] = "<font color='#bf1e2e'>Применить к персонажам, не являющимся солдатами</font>" ; red

strUniformUnitTypes = "Выберите персонажей, не являющихся солдатами"

[AM_MCM_Screen]
ModName = "Управление внешним видом"
PageTitle = "Внешний вид Иридара"
GroupHeader = "Общие настройки"

DISABLE_APPEARANCE_VALIDATION_REVIEW_Label = "Отключить проверку внешнего вида в обычном режиме"
DISABLE_APPEARANCE_VALIDATION_REVIEW_Tip = "Если вы начинаете игру с отсутствующими косметическими модами, игра обычно автоматически восстанавливает внешний вид оперативников, которые использовали косметические детали из этих модов. Этот параметр позволяет отключить эту функцию, чтобы ваши оперативники из пула персонажей могли сохранить свой внешний вид. Эта настройка влияет на обычный режим игры, когда она запускается с аргументом запуска \"-review\"."

DISABLE_APPEARANCE_VALIDATION_DEBUG_Label = "Отключить проверку внешнего вида в режиме отладки"
DISABLE_APPEARANCE_VALIDATION_DEBUG_Tip = "Если вы начинаете игру с отсутствующими косметическими модами, игра обычно автоматически восстанавливает внешний вид оперативников, которые использовали косметические детали из этих модов. Этот параметр позволяет отключить эту функцию, чтобы ваши персонажи могли сохранить свой внешний вид. Этот параметр влияет на режим отладки игры, когда она запускается без аргумента запуска \"-review\"."

DEBUG_LOGGING_Label = "Включить ведение журнала отладки"
DEBUG_LOGGING_Tip = "Если включено, мод будет печатать отладочные сообщения в файл журнала, расположенный по адресу:\n..\\Documents\\my games\\XCOM2 War of the Chosen\\XComGame\\Logs\\Launch.log"

REMEMBER_SCROLLBAR_POSITION_IN_CHARACTER_POOL_Label = "Запомнить положение полосы прокрутки в пуле персонажей"
REMEMBER_SCROLLBAR_POSITION_IN_CHARACTER_POOL_Tip = "Если включено, мод запомнит положение полосы прокрутки в пуле персонажей. Удобно для больших пулов персонажей."

AUTOMATIC_UNIFORM_MANAGEMENT_Label = "Включить автоматическое управление униформой по умолчанию"
AUTOMATIC_UNIFORM_MANAGEMENT_Tip = "Если этот мод включен, мод будет автоматически применять униформу к солдатам, когда они впервые надевают броню или когда их повышают до звания отряда. Эти униформы должны быть созданы и настроены в пуле персонажей. Этот параметр также можно настроить для каждого солдата индивидуально на экране настройки внешнего вида."

MANAGE_APPEARANCE_2D_Label = "Показать экран менеджер внешнего вида в 2D"
MANAGE_APPEARANCE_2D_Tip = "Заставляет экран отображаться поверх модели солдата, а не позади нее"

MULTIPLE_UNIT_CHANGE_REQUIRES_CONFIRMATION_Label = "Требовать подтверждения, чтобы применить изменения к нескольким объектам"
MULTIPLE_UNIT_CHANGE_REQUIRES_CONFIRMATION_Tip = "Если включено, Управление внешним видом будет отображать всплывающее сообщение, когда вы нажимаете \"Применить изменения\", если это приведет к изменению внешнего вида нескольких оперативников."

[Help]
strCurrentAppearance = "(Текущий)"

[UIManageAppearance_Uniform]
strGenderDisabled = "Униформа не может изменить пол оперативника. Смена пола отключена."
